---
type: IATFTranslationServer
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# IATFTranslationServer

`Autodesk.Revit.DB.IATFTranslationServer` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Translate | 2021 | `bool Translate ( ATFTranslationServiceData serviceData )` |